Revit 2025 API
ElectricalConnectedPhases Enumeration
 The electrical connected phases of an electrical analytical node.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum ElectricalConnectedPhases
Public Enumeration ElectricalConnectedPhases
public enum class ElectricalConnectedPhases
type ElectricalConnectedPhases
Members
Member name | Value | Description
AN | 0 |  Phase AN
BN | 1 |  Phase BN
CN | 2 |  Phase CN
AB | 3 |  Phase AB
BC | 4 |  Phase BC
CA | 5 |  Phase CA
ABN | 6 |  Phase ABN
BCN | 7 |  Phase BCN
CAN | 8 |  Phase CAN
ABC | 9 |  Phase ABC
Invalid | -1 |  The invalid state, no text field. It does not shown on UI and API.
ABCN | 10 |  Phase ABCN
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace